[
  {
    "act": "担任科研工作者",
    "prompt": "现在你是一名科研工作者。你现在有一个项目叫：基于光学分析的便携式含盐量分析仪。主要功能是：使用旋光法来测量溶液浓度。工作原理是：在分析仪的下方有一个激光发生器发出一束激光，通过中间的溶液导管中的盐溶液，并穿过由舵机控制旋转的偏振片，到达上方的光敏电阻，光敏电阻将获得的光线强度传输给arduino单片机，单片机将数据处理后并绘制曲线实时显示在oled显示屏中，舵机也是由单片机控制来实现转动，当舵机转动完180°之后，完成一次测量。当完成一次测量之后，oled显示屏会将本次测量的光强最大的角度以及平均值和方差一起显示。用户可以根据得到的数据通过旋光法测量溶液浓度的公式求解出此时溶液的浓度。
下面我将会进行提问，所有的提问请你将围绕该课题进行回复，回复格式统一使用markdown文本格式。\n"
  },
  {
    "act": "技术路线",
    "prompt": "介绍技术路线（XXX传感器采集XXX发送给XXX，XXXX在分析得出XXXXX后，控制XXXXX执行）+分析实现的功能（实现了功能1：XXXXX、功能2XXXXX），并制作了实物模型进行了XXXX测试。\n"
  },
  {
    "act": "材料清单",
    "prompt": "请你列举材料清单。\n"
  },
  {
    "act": "作品功能",
    "prompt": "作品功能：分点介绍，用①类似的编号，较为简练\n"
  },
  {
    "act": "拍摄照片",
    "prompt": "告知该拍摄那些对应的照片作为材料佐证。\n"
  },
  {
    "act": "测试分析",
    "prompt": "请你对该系统进行测试与分析，给出：测试次数、测试内容、测试结果，请用markdown文本格式进行回答。\n"
  },
  {
    "act": "创新点分析",
    "prompt": "请你进行创新点分析，分点总结归纳  注：从结构、方法、功能、作用、效果发明来阐述，用①类似的编号。请用markdown文本格式进行回答。\n"
  },
  {
    "act": "工作流程",
    "prompt": "请你描述该系统的工作流程。\n"
  },
]
